# Highly Recommended
cask 'google-chrome'
cask 'iterm2'
cask 'sublime-text'
cask 'docker'
cask 'visual-studio-code'
cask 'google-cloud-sdk'
brew 'git'

# For Zelus
## For pyenv
brew 'openssl' 
brew 'readline'
brew 'sqlite3'
brew 'xz'
brew 'zlib'

brew 'poetry'
brew 'pyenv'
brew 'pyenv-virtualenv'
brew 'r'
brew 'postgresql'
brew 'kubernetes-cli'
brew 'direnv'
brew 'duckdb'

brew 'pandoc'

# May find these helpful
cask 'alfred'
cask 'spectacle'
cask 'postman'
brew 'awscli'
brew 'jq'
# brew 'rclone'
# cask 'cyberduck'
# brew 'autoenv'
# brew 'bash'
# brew 'bash-completion'
# brew 'coreutils'  # to get realpath
# brew 'freetds@0.91'
# brew 'openssl'
# brew 'mycli'
# brew 'mysql', restart_service: true
# brew 'node'
# brew 'r'
# brew 'ruby'
# mas 'Xcode', id: 497799835